#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Reading...
module.fourkeys.module.gcloud_build_batch_logs_test_artifacts.data.external.env_override[0]: Reading...
module.fourkeys.module.gcloud_build_batch_logs_bq_writer.data.external.env_override[0]: Reading...
module.fourkeys.data.archive_file.gh_logs_bq_writer_source: Reading...
module.fourkeys.data.archive_file.events_bq_writer_source: Reading...
module.fourkeys.data.archive_file.demo: Reading...
module.fourkeys.data.archive_file.demo: Read complete after 0s [id=6c1bb5ba27bd83aabb22cffba9470a9ca91073b6]
module.fourkeys.data.archive_file.gh_logs_bq_writer_source: Read complete after 0s [id=6c1bb5ba27bd83aabb22cffba9470a9ca91073b6]
module.fourkeys.data.archive_file.events_bq_writer_source: Read complete after 0s [id=6f2d6c347b7f4e8eba5d12946eda38b1d84b2af7]
module.fourkeys.module.gcloud_build_batch_logs_bq_writer.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.module.gcloud_build_batch_logs_test_artifacts.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_destroy_command[0]: Refreshing state... [id=7501264970071068882]
module.fourkeys.module.gcloud_build_batch_logs_test_artifacts.null_resource.run_command[0]: Refreshing state... [id=4329998836720014215]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_command[0]: Refreshing state... [id=2671861280509006243]
module.fourkeys.module.gcloud_build_batch_logs_bq_writer.null_resource.run_destroy_command[0]: Refreshing state... [id=4247865089283958810]
module.fourkeys.module.gcloud_build_batch_logs_test_artifacts.null_resource.run_destroy_command[0]: Refreshing state... [id=754940318203282157]
module.fourkeys.module.gcloud_build_batch_logs_bq_writer.null_resource.run_command[0]: Refreshing state... [id=5738257688551693195]
module.fourkeys.data.google_project.project: Reading...
module.fourkeys.google_storage_bucket.gh_audit_log_archieve_local: Refreshing state... [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.google_storage_bucket.events_station_local: Refreshing state... [id=off-net-dev-events-station-local]
module.fourkeys.google_storage_bucket.events_archieve_local: Refreshing state... [id=off-net-dev-events-archieve-local]
module.fourkeys.google_storage_bucket.gh_audit_log_station_local: Refreshing state... [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.google_cloud_run_service.batch_events_bq_writer: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer]
module.fourkeys.google_cloud_run_service.batch_logs_bq_writer: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer]
module.fourkeys.google_bigquery_dataset.dataset: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys]
module.fourkeys.google_eventarc_trigger.primary: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/name]
module.fourkeys.google_eventarc_trigger.gh_logs_trigger: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/gh-logs-trigger]
module.fourkeys.google_bigquery_table.batch_logs: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_logs]
module.fourkeys.google_bigquery_table.batch_events: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_events]
module.fourkeys.data.google_project.project: Read complete after 0s [id=projects/off-net-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.fourkeys.google_cloud_run_service.batch_events_bq_writer will be updated in-place
  ~ resource "google_cloud_run_service" "batch_events_bq_writer" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer"
        name                       = "batch-events-bq-writer"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloud_run_service.batch_logs_bq_writer will be updated in-place
  ~ resource "google_cloud_run_service" "batch_logs_bq_writer" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer"
        name                       = "batch-logs-bq-writer"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo will be created
  + resource "google_cloud_run_service" "batch_logs_bq_writer_demo" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "northamerica-northeast1"
      + name                       = "batch-logs-bq-writer-demo"
      + project                    = "off-net-dev"
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/minScale" = "1"
                  + "client.knative.dev/user-image"    = "northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/batch_logs:6c1bb5ba27bd83aabb22cffba9470a9ca91073b6"
                  + "run.googleapis.com/client-name"   = "cloud-console"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "dora-wif@off-net-dev.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/batch_logs:6c1bb5ba27bd83aabb22cffba9470a9ca91073b6"
                  + name  = (known after apply)

                  + env {
                      + name  = "project-name"
                      + value = "off-net-dev"
                    }

                  + resources {
                      + limits = {
                          + "memory" = "1024Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.fourkeys.google_eventarc_trigger.gh_logs_trigger_demo will be created
  + resource "google_eventarc_trigger" "gh_logs_trigger_demo" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + event_data_content_type = (known after apply)
      + id                      = (known after apply)
      + location                = "northamerica-northeast1"
      + name                    = "gh-logs-trigger-demo"
      + project                 = "off-net-dev"
      + service_account         = "dora-wif@off-net-dev.iam.gserviceaccount.com"
      + terraform_labels        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)

      + destination {
          + cloud_run_service {
              + path    = "/logs"
              + region  = "northamerica-northeast1"
              + service = "batch-logs-bq-writer-demo"
            }
        }

      + matching_criteria {
          + attribute = "bucket"
          + value     = "off-net-dev-gh-audit-log-archieve-local"
        }
      + matching_criteria {
          + attribute = "type"
          + value     = "google.cloud.storage.object.v1.finalized"
        }
    }

  # module.fourkeys.module.gcloud_build_batch_logs_test_artifacts.null_resource.run_destroy_command[0] must be replaced
-/+ resource "null_resource" "run_destroy_command" {
      ~ id       = "754940318203282157" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "destroy_cmd_body"       = "container images delete northamerica-northeast1-docker.pkg.dev/fourkeys-31337/gcf-artifacts/off-net-dev/batch_logs:6c1bb5ba27bd83aabb22cffba9470a9ca91073b6 --quiet" -> "container images delete northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/batch_logs:6c1bb5ba27bd83aabb22cffba9470a9ca91073b6 --quiet"
            # (2 unchanged elements hidden)
        }
    }

Plan: 3 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*